Catalogs/КафкаШины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>КафкаШины</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кластер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КафкаКластеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВид</Name>
					<Comment>Источник/Приемник</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Comment>Топик Кафки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючСердес</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КафкаСердес</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеСердес</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КафкаСердес</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменДлительностьСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменКоличествоПотоков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменНаправление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КафкаНаправленияОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменРасписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменРасписаниеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменРасписаниеРазброс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентТаймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправкаБлокироватьТаблицуРегистрации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриемПроцедура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриемВРеальномВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриемТаймаутОжидания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательРЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительИнфо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательИнфо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КафкаКонфигурация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КафкаПозиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>КафкаПозиции</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кластер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КафкаКластеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/КафкаНаправленияОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Enum>
		<Properties>
			<Name>КафкаНаправленияОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КафкаШины/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем ПараметрыФоновогоЗадания;

#Область СобытияФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ОбменРасписание = ПолучитьИзВременногоХранилища(ОбменРасписаниеАдрес);
	ТекущийОбъект.ОбменРасписание = Новый ХранилищеЗначения(ОбменРасписание);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ПриЧтенииСозданииНаСервере(ТекущийОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбновлениеСмещенийТемы

&НаКлиенте
Процедура ЗагрузкаПозицииПриАктивизацииСтроки(Элемент)

	Если Элементы.ЗагрузкаПозиции.ТекущаяСтрока = Неопределено
	И Объект.ОбменНаправление = ПредопределенноеЗначение("Перечисление.КафкаНаправленияОбмена.Загрузка") И Не ПустаяСтрока(Объект.Тема)
	И ПараметрыФоновогоЗадания=Неопределено Тогда
		ОбновитьПозицииЗагрузки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьПозицииЗагрузки(Команда)

	ОбновитьПозицииЗагрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПозицииЗагрузки()
	
	ЗаполнитьТекущиеПозицииЧтения();
	
	ПараметрыФоновогоЗадания = ЗапуститьПолучениеСмещенийТемыВФоне(Объект.Кластер, Объект.Тема, ЭтаФорма.УникальныйИдентификатор);
	Если ПараметрыФоновогоЗадания <> Неопределено Тогда
		ПодключитьОбработчикОжидания("ОпросФоновогоЗадания", 2, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаПозицииИнициализировать()
	
	ЗагрузкаПозиции.Очистить();
	ЗагрузкаПозицияТекущая   = "<не применимо>";
	ЗагрузкаПозицияНачальная = "<не получено>";
	ЗагрузкаПозицияКонечная  = "<не получено>";
	ЗагрузкаОтставание		 = "<не получено>";
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущиеПозицииЧтения()
	
	ЗагрузкаПозицииИнициализировать();
					
	_ЗагрузкаПозицияТекущая   = 0;
	
	_Тема = КафкаСервер.Тема(Объект.Тема);
	_Тема = СтрЗаменить(_Тема, "*", "%");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Позиции.Тема КАК Тема,
	|	Позиции.Раздел КАК Раздел,
	|	Позиции.ДатаУстановки КАК ДатаУстановки,
	|	Позиции.Позиция КАК Позиция
	|ИЗ
	|	РегистрСведений.КафкаПозиции.СрезПоследних(
	|			,
	|			Кластер = &Кластер
	|				И Тема ПОДОБНО &Тема) КАК Позиции
	|
	|УПОРЯДОЧИТЬ ПО
	|	Тема,
	|	Раздел");
	Запрос.УстановитьПараметр("Кластер", Объект.Кластер);	
	Запрос.УстановитьПараметр("Тема", _Тема);	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	СтруктураПоиск = Новый Структура("Раздел");
	
	Для Каждого с Из ТЗ Цикл
		сс = ЗагрузкаПозиции.Добавить();
		сс.Тема = с.Тема;
		сс.Раздел = с.Раздел;
		сс.Текущая = Формат(с.Позиция, "ЧН=0");
		сс.ДатаФиксации = с.ДатаУстановки;
		сс.Начальная = "<не получено>";
		сс.Конечная = "<не получено>";
		сс.Отставание = "<не получено>";
		_ЗагрузкаПозицияТекущая = _ЗагрузкаПозицияТекущая + с.Позиция;
	КонецЦикла;
	
	ЗагрузкаПозицияТекущая = Формат(_ЗагрузкаПозицияТекущая, "ЧН=0");
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапуститьПолучениеСмещенийТемыВФоне(Кластер, Знач Тема, ФормаУникальныйИдентификатор)
	
	Тема = КафкаСервер.Тема(Тема);
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, ФормаУникальныйИдентификатор);
	
	ПараметрыФЗ = Новый Массив;
	ПараметрыФЗ.Добавить(Кластер);
	ПараметрыФЗ.Добавить(Тема);
	ПараметрыФЗ.Добавить(АдресРезультата);
	
	ФЗ = ФоновыеЗадания.Выполнить("КафкаСервер.ПолучитьСмещенияТемыВФоне", ПараметрыФЗ, ,
			"Кафка: Запрос информации темы """+Тема+"""");
			
	Возврат Новый ФиксированнаяСтруктура("УникальныйИдентификатор, АдресРезультата", ФЗ.УникальныйИдентификатор, АдресРезультата);
			
КонецФункции

&НаКлиенте
Процедура ОпросФоновогоЗадания()
	
	РезультатФЗ = ОпросФоновогоЗаданияНаСервере(ПараметрыФоновогоЗадания);
	Если РезультатФЗ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("ОпросФоновогоЗадания");
	
	Если ТипЗнч(РезультатФЗ) = Тип("Строка") Тогда
		Сообщить(РезультатФЗ);
	Иначе
		Если РезультатФЗ.Успех Тогда
			ОбновитьСмещенияТемы(РезультатФЗ.Результат);
		Иначе
			Сообщить(РезультатФЗ.ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция ОпросФоновогоЗаданияНаСервере(ПараметрыФЗ)
	
	ФЗ = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ПараметрыФЗ.УникальныйИдентификатор);
	Если ФЗ = Неопределено Тогда
		Возврат "Не найдено фоновое задание опроса темы.";
	КонецЕсли;
	
	Если ФЗ.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Возврат Неопределено;
	ИначеЕсли ФЗ.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
		Результат = ПолучитьИзВременногоХранилища(ПараметрыФЗ.АдресРезультата);
		УдалитьИзВременногоХранилища(ПараметрыФЗ.АдресРезультата);
		Если Результат = Неопределено Тогда
			Возврат "Фоновое задание опроса темы возвратило пустой результат";
		КонецЕсли;
		Возврат Результат;
	ИначеЕсли ФЗ.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		Возврат "Фоновое задание опроса темы завершено аварийно."
			+ ?(ФЗ.ИнформацияОбОшибке=Неопределено, "", Символы.ПС+КафкаКлиентСервер.КорневаяИнформацияОбОшибке(ФЗ.ИнформацияОбОшибке).Описание);
	Иначе
		Возврат "Фоновое задание опроса темы отменено.";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСмещенияТемы(СмещенияТемы)
	
	_ЗагрузкаПозицияНачальная = 0;
	_ЗагрузкаПозицияКонечная  = 0;
	_ЗагрузкаОтставание  = 0;
	
	ИндексТемы = Новый Соответствие;
	Для Каждого С Из ЗагрузкаПозиции Цикл
		ИндексРазделы = ИндексТемы.Получить(С.Тема);
		Если ИндексРазделы = Неопределено Тогда
			ИндексРазделы = Новый Соответствие;
			ИндексТемы.Вставить(С.Тема, ИндексРазделы);
		КонецЕсли;
		ИндексРазделы.Вставить(С.Раздел, С);
	КонецЦикла;
	
	СтруктураПоиск = Новый Структура("Тема, Раздел");
	Для Каждого PartitionOffsets Из СмещенияТемы Цикл
				
		ИндексРазделы = ИндексТемы.Получить(PartitionOffsets.Topic);
		
		Если ИндексРазделы = Неопределено Тогда
			ИндексРазделы = Новый Соответствие;
			ИндексТемы.Вставить(PartitionOffsets.Topic, ИндексРазделы);
		КонецЕсли;
		
		СтрокаРаздел = ИндексРазделы.Получить(PartitionOffsets.Partition);
		
		Если СтрокаРаздел = Неопределено Тогда
			
			СтрокаРаздел = ЗагрузкаПозиции.Добавить();
			СтрокаРаздел.Тема = PartitionOffsets.Topic;
			СтрокаРаздел.Раздел = PartitionOffsets.Partition;
			СтрокаРаздел.Текущая = ?(ЗагрузкаПозицияТекущая="<не применимо>", ЗагрузкаПозицияТекущая, "0");
			
			ИндексРазделы.Вставить(PartitionOffsets.Partition, СтрокаРаздел);
			
		КонецЕсли;
				
		СтрокаРаздел.Начальная = Формат(PartitionOffsets.Low, "ЧН=0");
		СтрокаРаздел.Конечная = Формат(PartitionOffsets.High, "ЧН=0");
		
		_ЗагрузкаПозицияНачальная = _ЗагрузкаПозицияНачальная + PartitionOffsets.Low;
		_ЗагрузкаПозицияКонечная  = _ЗагрузкаПозицияКонечная  + PartitionOffsets.High;
		
	КонецЦикла;
	
	ЗагрузкаПозицияНачальная = _ЗагрузкаПозицияНачальная;
	ЗагрузкаПозицияКонечная  = _ЗагрузкаПозицияКонечная;
	
	Для Каждого СтрокаРаздел Из ЗагрузкаПозиции Цикл
		Если СтрокаРаздел.Текущая = "<не применимо>" Тогда
			СтрокаРаздел.Отставание = СтрокаРаздел.Текущая;
			Продолжить;
		КонецЕсли;
		Если СтрокаРаздел.Конечная = "<не получено>" Тогда
			СтрокаРаздел.Отставание = СтрокаРаздел.Конечная;
			Продолжить;
		КонецЕсли;
		ОтставаниеЧисло = Число(СтрокаРаздел.Конечная) - Макс(Число(СтрокаРаздел.Начальная), Число(СтрокаРаздел.Текущая));
		СтрокаРаздел.Отставание = Формат(ОтставаниеЧисло, "ЧН=0");
		_ЗагрузкаОтставание = _ЗагрузкаОтставание + ОтставаниеЧисло;
	КонецЦикла;
	ЗагрузкаОтставание = _ЗагрузкаОтставание;
	
	ЗагрузкаПозиции.Сортировать("Тема, Раздел");
	
КонецПроцедуры

#КонецОбласти

#Область РасписаниеОбмена

&НаКлиенте
Процедура ОбменРасписаниеНажатие(Элемент)
	
	ОбменРасписаниеПоказатьДиалог();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменРасписаниеПоказатьДиалог()
	
	Расписание = ПолучитьИзВременногоХранилища(ОбменРасписаниеАдрес);
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбменРасписаниеПриЗакрытииДиалога", ЭтаФорма);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры
&НаКлиенте
Процедура ОбменРасписаниеПриЗакрытииДиалога(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбменРасписаниеАдрес = ПоместитьВоВременноеХранилище(Расписание, УникальныйИдентификатор);
	
	Элементы.ОбменРасписание.Заголовок = Строка(Расписание);
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПриЧтенииСозданииНаСервере(ТекущийОбъект=Неопределено)
	
	Если Не ПустаяСтрока(Объект.Тема) Тогда
		РеальнаяТема = КафкаСервер.Тема(Объект.Тема);
	Иначе
		РеальнаяТема = "";
	КонецЕсли;
	
	Если ТекущийОбъект <> Неопределено Тогда
		ОбменРасписание = ТекущийОбъект.ОбменРасписание.Получить();
	КонецЕсли;
	Если ОбменРасписание = Неопределено Тогда
		ОбменРасписание = Справочники.КафкаШины.ОбменРасписаниеПоУмолчанию();
	КонецЕсли;
	Элементы.ОбменРасписание.Заголовок = Строка(ОбменРасписание);
	
	Если ОбменРасписаниеАдрес <> "" Тогда
		УдалитьИзВременногоХранилища(ОбменРасписаниеАдрес);
	КонецЕсли;
	ОбменРасписаниеАдрес = ПоместитьВоВременноеХранилище(ОбменРасписание, УникальныйИдентификатор);
	
	ЗагрузкаПозицииИнициализировать();
	
	Элементы.ФормаВыполнитьОбмен.Видимость =
			ПравоДоступа("Редактирование", Метаданные.Справочники.КафкаШины);
			
	ОбновитьВидимостьДоступность(ЭтаФорма);
			
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВидимостьДоступность(Форма)
	
	Форма.Элементы.СтраницаПрием.Видимость = (Форма.Объект.ОбменНаправление = ПредопределенноеЗначение("Перечисление.КафкаНаправленияОбмена.Загрузка"));
	Форма.Элементы.СтраницаОтправка.Видимость = (Форма.Объект.ОбменНаправление = ПредопределенноеЗначение("Перечисление.КафкаНаправленияОбмена.Выгрузка"));
	
	Форма.Элементы.ОбменДлительностьСеанса.АвтоОтметкаНезаполненного = Форма.Объект.ПриемВРеальномВремени;
	
	Форма.Элементы.ЗагрузкаПозицииТема.Видимость = СтрЗаканчиваетсяНа(Форма.Объект.Тема, "*");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменНаправлениеПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриемВРеальномВремениПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнитьОбмен(Команда)
	
	ВыполнитьОбмен();
	
КонецПроцедуры
&НаКлиенте
Процедура ВыполнитьОбмен()
	
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Текст = "Перед ручным запуском обмена объект должен быть записан.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбменНаСервере(Объект.Ссылка);
	
КонецПроцедуры
&НаСервереБезКонтекста
Процедура ВыполнитьОбменНаСервере(ШинаСсылка)
	
	Справочники.КафкаШины.ВыполнитьОбмен(ШинаСсылка);
	
КонецПроцедуры
